# Visulização com seaborn

In [39]:
import pandas as pd

In [40]:
dados = pd.read_csv('tips.csv')

In [41]:
dados

     total_bill   tip dessert   day    time  size
0         16.99  1.01      No   Sun  Dinner     2
1         10.34  1.66      No   Sun  Dinner     3
2         21.01  3.50      No   Sun  Dinner     3
3         23.68  3.31      No   Sun  Dinner     2
4         24.59  3.61      No   Sun  Dinner     4
..          ...   ...     ...   ...     ...   ...
239       29.03  5.92      No   Sat  Dinner     3
240       27.18  2.00     Yes   Sat  Dinner     2
241       22.67  2.00     Yes   Sat  Dinner     2
242       17.82  1.75      No   Sat  Dinner     2
243       18.78  3.00      No  Thur  Dinner     2

[244 rows x 6 columns]

## Renomear nome das colunas

In [42]:
dados.columns

Index(['total_bill', 'tip', 'dessert', 'day', 'time', 'size'], dtype='object')

In [43]:
renomear = {'total_bill' : 'valor_total',
            'tip' : 'gorjeta',
            'dessert' : 'sobremesa',
            'day' : 'dia',
            'time' : 'hora_do_dia',
            'size': 'total_de_pessoas'
           }

In [44]:
gorjetas = dados.rename(columns = renomear)

In [45]:
gorjetas.head(1)

   valor_total  gorjeta sobremesa  dia hora_do_dia  total_de_pessoas
0        16.99     1.01        No  Sun      Dinner                 2

In [46]:
gorjetas.sobremesa.unique()

array(['No', 'Yes'], dtype=object)

In [47]:
sim_nao = {'No' : 'Não', 
           'Yes': 'Sim'}

In [48]:
gorjetas.sobremesa.map(sim_nao)

0      Não
1      Não
2      Não
3      Não
4      Não
      ...
239    Não
240    Sim
241    Sim
242    Não
243    Não
Name: sobremesa, Length: 244, dtype: object

In [49]:
gorjetas.head(1)

   valor_total  gorjeta sobremesa  dia hora_do_dia  total_de_pessoas
0        16.99     1.01        No  Sun      Dinner                 2

In [50]:
gorjetas.sobremesa = gorjetas.sobremesa.map(sim_nao)

In [51]:
gorjetas.head(1)

   valor_total  gorjeta sobremesa  dia hora_do_dia  total_de_pessoas
0        16.99     1.01       Não  Sun      Dinner                 2

In [52]:
gorjetas.dia.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [53]:
dias = {'Sun': 'Domingo',
         'Sat': 'Sábado',
         'Thur': 'Quinta',
         'Fri': 'Sexta'}

In [54]:
gorjetas.dia = gorjetas.dia.map(dias)

In [55]:
gorjetas.hora_do_dia.unique()

array(['Dinner', 'Lunch'], dtype=object)

In [56]:
refeicao = {'Dinner' : 'Jantar',
            'Lunch': 'Almoço'}

In [57]:
gorjetas.hora_do_dia = gorjetas.hora_do_dia.map(refeicao)

In [58]:
gorjetas.head(1)

   valor_total  gorjeta sobremesa      dia hora_do_dia  total_de_pessoas
0        16.99     1.01       Não  Domingo      Jantar                 2

In [59]:
gorjetas = gorjetas.rename(columns = {'dia': 'dia_da_semana'})

In [60]:
gorjetas.head(1)

   valor_total  gorjeta sobremesa dia_da_semana hora_do_dia  total_de_pessoas
0        16.99     1.01       Não       Domingo      Jantar                 2

In [61]:
gorjetas.to_csv('gorjetas.csv', sep=';', index=False)